const errorModel = require('../../model/errorModel')
const succeedModel = require('../../model/succeedModel')
module.exports = function(ctx, next){
    const { count, password } = ctx.request.body
    ctx.status = 200
    ctx.body = succeedModel([
        {
            "preface": "持区布龙例细导如状定即节划。无素历了六证决物北织并为后半感都机时。切干太圆且果布走利包县有长成万际派。",
            "title": "认立布劳式七术明需结",
            "date": "1976-05-01 21:44:01"
        },
        {
            "preface": "重周正合证花约改车白列法状程土别适。示别极解增观更其热更边林。音美西马增比料口作革常被较真细阶。由山老石车对论自张府持部从风青选复。",
            "title": "书斯日斗特统音山积细",
            "date": "1986-11-06 14:36:32"
        },
        {
            "preface": "及层积北省始己转响强器存长存采。只系且你公写除专别拉精条干林。其林部往受习所东战程斗上造。难别须见产空列需层实马色。力技石传两金拉对识土也者论原。",
            "title": "老易少面但九八和声式与",
            "date": "1990-04-29 20:06:21"
        },
        {
            "preface": "些团准华可后圆导代题格料期主。术阶般飞率等程统步例识先多每性值合。向族关中美看特此十越地知业义线看。空家段体议话现类里资于米于验。厂利二高式金自大拉开原民列任会严。华你什山证管上重保儿眼青色该适达。",
            "title": "近争心只看道改",
            "date": "1971-10-27 20:16:06"
        },
        {
            "preface": "结会低白响子次一史交属即温位周目代。转张听节识置单价下面石天产龙。置什就却集选无图农直斯万则再正。合公接积整治导亲派安快主效图地达。处该天先无白金候七强应角。至快期量温专有王当就身究重。比家加周这阶府地矿不月西于民厂状。",
            "title": "党原思存色具团以完厂群",
            "date": "1987-09-14 13:56:09"
        }
    ])
}
